In [18]:
import pandas as pd
import numpy as np

In [19]:
car = pd.read_csv('All_CSV/cars.csv')

In [20]:
car.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [21]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   brand          8128 non-null   object
 1   km_driven      8128 non-null   int64
 2   fuel           8128 non-null   object
 3   owner          8128 non-null   object
 4   selling_price  8128 non-null   int64
dtypes: int64(2), object(3)
memory usage: 317.6+ KB

In [22]:
car['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [23]:
car['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [24]:
car['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

# One hot Encoding using Pandas
## dont remember the code
## dont make change into the main dataFrame

In [25]:
pd.get_dummies(car, columns = ['owner', 'fuel'])

,brand,km_driven,selling_price,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol
0,Maruti,145500,450000,True,False,False,False,False,False,True,False,False
1,Skoda,120000,370000,False,False,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,True,False,False
4,Maruti,120000,130000,True,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,True,False,False,False,False,False,False,False,True
8124,Hyundai,119000,135000,False,True,False,False,False,False,True,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,True,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,True,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,True,False,False

In [26]:
pd.get_dummies(car, columns = ['owner', 'fuel'], drop_first= True)

,brand,km_driven,selling_price,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner,fuel_Diesel,fuel_LPG,fuel_Petrol
0,Maruti,145500,450000,False,False,False,False,True,False,False
1,Skoda,120000,370000,False,True,False,False,True,False,False
2,Honda,140000,158000,False,False,False,True,False,False,True
3,Hyundai,127000,225000,False,False,False,False,True,False,False
4,Maruti,120000,130000,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,False,False,False,False,True
8124,Hyundai,119000,135000,True,False,False,False,True,False,False
8125,Maruti,120000,382000,False,False,False,False,True,False,False
8126,Tata,25000,290000,False,False,False,False,True,False,False
8127,Tata,25000,290000,False,False,False,False,True,False,False

# One Hot Encoding using Sciket learn

In [27]:
from sklearn.model_selection import train_test_split

In [28]:
train_x, test_x, train_y, test_y = train_test_split(car.iloc[:, 0:4], car.iloc[:, -1], test_size = 0.2)

In [29]:
train_x

         brand  km_driven    fuel                 owner
5050    Maruti      25000  Diesel           First Owner
2357   Renault       9656  Petrol           First Owner
4291    Maruti     120000  Petrol          Second Owner
7436  Mahindra      40000  Diesel           First Owner
6267   Hyundai       4300  Petrol           First Owner
...        ...        ...     ...                   ...
6080    Maruti      50000  Diesel           First Owner
5029    Maruti     100000  Petrol  Fourth & Above Owner
4132  Mahindra     120000  Diesel           First Owner
6810    Maruti      70000  Petrol           First Owner
3361   Renault      48406  Diesel           First Owner

[6502 rows x 4 columns]

In [30]:
from sklearn.preprocessing import OneHotEncoder

In [31]:
encoder = OneHotEncoder(drop ='first')

In [32]:
new_train_x = encoder.fit_transform(car[['fuel', 'owner']])
new_test_x = encoder.transform(car[['fuel', 'owner']])

In [35]:
new_train_x

<8128x7 sparse matrix of type '<class 'numpy.float64'>'
	with 10910 stored elements in Compressed Sparse Row format>

# Concenating function is not working

In [34]:
np.hstack((train_x[['brand', 'km_driven']].values, new_train_x))

ValueError: all the input arrays must have same number of dimensions, but the array at index 0 has 2 dimension(s) and the array at index 1 has 1 dimension(s)

# making uncommon array

In [ ]:
count = car['brand'].value_counts()

In [ ]:

thrashold = 100

In [ ]:
repl = count[count <= thrashold].index

In [ ]:
pd.get_dummies(car['brand'].replace(repl, 'Uncommon')).sample(10)